In [ ]:
l = [[1,2,3], 445, 91,2, (1,2,3)]

In [40]:
#print element:count if count>1 for element in list
for i in l:
    print(i)
    c=[]
    for j in i:
        if i.count(j)>1 and j not in c:
            c.append(j)
            print(j, ">", i.count(j))

[1, 1, 2, 2, 3, 3]
1 > 2
2 > 2
3 > 2
[6, 6, 6, 6]
6 > 4
[1, 5, 8, 8, 2]
8 > 2

In [61]:
s= "ineuron"
[i for i in s]

['i', 'n', 'e', 'u', 'r', 'o', 'n']

In [77]:
d = {"ab": {"a": 23, "b": 34, "c": 56}, "course": {'d': 122 , 'e': 99}, 45:88}

In [78]:
max = 0
for i in d.values():
    if type(i) ==int:
        if i>max:
            max=i
    else:
        if type(i)==dict:
            for j in i.values():
                if j>max:
                    max=j
print(max)

122

dict_values([{'a': 23, 'b': 34, 'c': 56}, {'d': 122, 'e': 99}, 889])

In [6]:
def add(a,b):
    return(a+b)

In [8]:
add(3,4)+4

11

In [7]:
type(add(3,4))

int

In [12]:
l = ["vish", "dutt", 3,5,6]

In [13]:
count=0
for i in l:
    if type(i)==str:
        count+=1
print(count)

2

In [17]:
try:
    1/0
except Exception as e:
    print(e)
    print("h")

division by zero
h

In [18]:
pwd()

'C:\\Users\\vishaldu'

In [23]:
f = open("text.txt",'w')
f.write("this is my first file")

21

In [9]:
def askinteger():
    l=[]
    while len(l)<10:
        try:
            a = int(input())
            try:
                if a<4:
                    raise Exception("Error: Enter an integer greater than 4")
                else:
                    l.append(a)
            except Exception as e:
                print(e)
        except:
            print("Enter a valid integer")
        continue
    print(l)

In [11]:
import pandas as pd

In [14]:
df = pd.read_csv(r"C:\Users\vishaldu\DOCS\Miscellaneous\titanic_dataset.csv")

In [22]:
df[df.dtypes[df.dtypes==object].index]

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,NaN,Q

In [31]:
df[df["Age"].isnull() == True]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [32]:
import numpy as np

In [34]:
row_index = np.where(df["Age"].isnull() == True)

In [37]:
df.iloc[row_index]["Name"]

5                              Moran, Mr. James
17                 Williams, Mr. Charles Eugene
19                      Masselmani, Mrs. Fatima
26                      Emir, Mr. Farred Chehab
28                O'Dwyer, Miss. Ellen "Nellie"
                         ...
859                            Razi, Mr. Raihed
863           Sage, Miss. Dorothy Edith "Dolly"
868                 van Melkebeke, Mr. Philemon
878                          Laleff, Mr. Kristo
888    Johnston, Miss. Catherine Helen "Carrie"
Name: Name, Length: 177, dtype: object

In [40]:
df["Fare"].max()

512.3292

In [47]:
df[df["Fare"] == df["Fare"].max()]["Name"]

258                      Ward, Miss. Anna
679    Cardeza, Mr. Thomas Drake Martinez
737                Lesurer, Mr. Gustave J
Name: Name, dtype: object

In [52]:
df[df["Sex"] == "male"]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [53]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [54]:
df["test"]= df["Pclass"] + df["SibSp"]

In [66]:

import numpy as np

In [71]:
df["Age"].replace(np.NaN, df["Age"].mean(), inplace = True)

In [72]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.7500,NaN,Q

In [2]:
pip install pymongo

Requirement already satisfied: pymongo in c:\users\vishaldu\anaconda3\lib\site-packages (4.2.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pymongo

In [4]:

client = pymongo.MongoClient("mongodb+srv://vdutt_1:Vibha1994@cluster0.lwoi7.mongodb.net/?retryWrites=true&w=majority")
db = client.test

In [5]:
database_name = "Student"
student_database = client[database_name]

In [6]:
collection = "Student_details"
student_database_collection = student_database[collection]

In [7]:
Student_data = {"Name": "Vishal",
                "Age": 28,
                "Address":"WF"     
}

In [8]:
student_database_collection.insert_one(Student_data)

In [9]:
student_cursor = student_database_collection.find()

In [10]:
student_cursor.next()

{'_id': ObjectId('630dc72e0b53e926a3c3c6ca'),
 'Name': 'Vishal',
 'Age': 28,
 'Address': 'WF'}

In [17]:
Student_data_list = [
{"Name": "Vibha","Age": 28,"Address":"WF" },
{"Name": "Viraj","Age": 6,"Address":"WF" },
{"Name": "Virat","Age": 5,"Address":"WF" }
]

In [18]:
student_database_collection.insert_many(Student_data_list)

In [20]:
for student in student_database_collection.find():
    print(student)

{'_id': ObjectId('630dc72e0b53e926a3c3c6ca'), 'Name': 'Vishal', 'Age': 28, 'Address': 'WF'}
{'_id': ObjectId('630dc96a0b53e926a3c3c6cb'), 'Name': 'Vibha', 'Age': 28, 'Address': 'WF'}
{'_id': ObjectId('630dc96a0b53e926a3c3c6cc'), 'Name': 'Viraj', 'Age': 6, 'Address': 'WF'}
{'_id': ObjectId('630dc96a0b53e926a3c3c6cd'), 'Name': 'Virat', 'Age': 5, 'Address': 'WF'}

In [21]:
#filter

query = {"Name": "Vishal"}

In [22]:
for student in student_database_collection.find(query):
    print(student)

{'_id': ObjectId('630dc72e0b53e926a3c3c6ca'), 'Name': 'Vishal', 'Age': 28, 'Address': 'WF'}

In [1]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\vishaldu\anaconda3\lib\site-packages (8.0.30)
Requirement already satisfied: protobuf<=3.20.1,>=3.11.0 in c:\users\vishaldu\anaconda3\lib\site-packages (from mysql-connector-python) (3.19.1)

In [2]:
import mysql.connector as conn

In [30]:
mydb = conn.connect(host ='localhost',user = 'root', passwd = 'Pool@123', database = 'sys')

In [31]:
mydb

In [32]:
query = "show databases"

In [25]:
cursor = mydb.cursor()
cursor.execute(query)

In [26]:
cursor.fetchall()

[('information_schema',), ('mysql',), ('performance_schema',), ('sys',)]

In [57]:
cursor = mydb.cursor()
cursor.execute("drop table BOM")

ProgrammingError: 1051 (42S02): Unknown table 'sys.bom'

In [34]:
cursor.fetchall()

[('host_summary',),
 ('host_summary_by_file_io',),
 ('host_summary_by_file_io_type',),
 ('host_summary_by_stages',),
 ('host_summary_by_statement_latency',),
 ('host_summary_by_statement_type',),
 ('innodb_buffer_stats_by_schema',),
 ('innodb_buffer_stats_by_table',),
 ('innodb_lock_waits',),
 ('io_by_thread_by_latency',),
 ('io_global_by_file_by_bytes',),
 ('io_global_by_file_by_latency',),
 ('io_global_by_wait_by_bytes',),
 ('io_global_by_wait_by_latency',),
 ('latest_file_io',),
 ('memory_by_host_by_current_bytes',),
 ('memory_by_thread_by_current_bytes',),
 ('memory_by_user_by_current_bytes',),
 ('memory_global_by_current_bytes',),
 ('memory_global_total',),
 ('metrics',),
 ('persons',),
 ('processlist',),
 ('ps_check_lost_instrumentation',),
 ('schema_auto_increment_columns',),
 ('schema_index_statistics',),
 ('schema_object_overview',),
 ('schema_redundant_indexes',),
 ('schema_table_lock_waits',),
 ('schema_table_statistics',),
 ('schema_table_statistics_with_buffer',),
 ('schema_tables_with_full_table_scans',),
 ('schema_unused_indexes',),
 ('session',),
 ('session_ssl_status',),
 ('statement_analysis',),
 ('statements_with_errors_or_warnings',),
 ('statements_with_full_table_scans',),
 ('statements_with_runtimes_in_95th_percentile',),
 ('statements_with_sorting',),
 ('statements_with_temp_tables',),
 ('sys_config',),
 ('user_summary',),
 ('user_summary_by_file_io',),
 ('user_summary_by_file_io_type',),
 ('user_summary_by_stages',),
 ('user_summary_by_statement_latency',),
 ('user_summary_by_statement_type',),
 ('version',),
 ('wait_classes_global_by_avg_latency',),
 ('wait_classes_global_by_latency',),
 ('waits_by_host_by_latency',),
 ('waits_by_user_by_latency',),
 ('waits_global_by_latency',),
 ('x$host_summary',),
 ('x$host_summary_by_file_io',),
 ('x$host_summary_by_file_io_type',),
 ('x$host_summary_by_stages',),
 ('x$host_summary_by_statement_latency',),
 ('x$host_summary_by_statement_type',),
 ('x$innodb_buffer_stats_by_schema',),
 ('x$innodb_buffer_stats_by_table',),
 ('x$innodb_lock_waits',),
 ('x$io_by_thread_by_latency',),
 ('x$io_global_by_file_by_bytes',),
 ('x$io_global_by_file_by_latency',),
 ('x$io_global_by_wait_by_bytes',),
 ('x$io_global_by_wait_by_latency',),
 ('x$latest_file_io',),
 ('x$memory_by_host_by_current_bytes',),
 ('x$memory_by_thread_by_current_bytes',),
 ('x$memory_by_user_by_current_bytes',),
 ('x$memory_global_by_current_bytes',),
 ('x$memory_global_total',),
 ('x$processlist',),
 ('x$ps_digest_95th_percentile_by_avg_us',),
 ('x$ps_digest_avg_latency_distribution',),
 ('x$ps_schema_table_statistics_io',),
 ('x$schema_flattened_keys',),
 ('x$schema_index_statistics',),
 ('x$schema_table_lock_waits',),
 ('x$schema_table_statistics',),
 ('x$schema_table_statistics_with_buffer',),
 ('x$schema_tables_with_full_table_scans',),
 ('x$session',),
 ('x$statement_analysis',),
 ('x$statements_with_errors_or_warnings',),
 ('x$statements_with_full_table_scans',),
 ('x$statements_with_runtimes_in_95th_percentile',),
 ('x$statements_with_sorting',),
 ('x$statements_with_temp_tables',),
 ('x$user_summary',),
 ('x$user_summary_by_file_io',),
 ('x$user_summary_by_file_io_type',),
 ('x$user_summary_by_stages',),
 ('x$user_summary_by_statement_latency',),
 ('x$user_summary_by_statement_type',),
 ('x$wait_classes_global_by_avg_latency',),
 ('x$wait_classes_global_by_latency',),
 ('x$waits_by_host_by_latency',),
 ('x$waits_by_user_by_latency',),
 ('x$waits_global_by_latency',)]

In [35]:
import pandas as pd

In [36]:
pd.read_sql('select * from persons', mydb)

C:\Users\vishaldu\Anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   PersonID LastName FirstName
0         1     Dutt    Vishal

In [108]:
cursor = mydb.cursor()
cursor.execute("create table bom6(Location INT(10),Product VARCHAR(100),Bill_of_material INT(10),Indicator_alternative1 VARCHAR(20),Indicator_alternative2 VARCHAR(20),Product_1 VARCHAR(100),Material_Description1 VARCHAR(200),BOM_item_category VARCHAR(20),BOM_Item_Number INT(20),Dependent_Material VARCHAR(200),Material_Description VARCHAR(200),Valid_From DATETIME ,Valid_To DATETIME,BOM_usage INT(20),BOM_Quantity FLOAT(20),Product_Type VARCHAR(20),Flag VARCHAR(20),Region VARCHAR(20))")

In [45]:
ls()

 Volume in drive C is PC COE
 Volume Serial Number is 1412-B747

 Directory of C:\Users\vishaldu\Python Scripts

File Not Found

In [41]:
import csv